In [13]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\mrbas\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mrbas\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mrbas\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mrbas\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mrbas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mrbas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [15]:
import pandas as pd

In [17]:
import numpy as np

In [19]:
pd.Series()

Series([], dtype: object)

In [27]:
s=pd.Series (np.random.random(10))
print (s)
s.shape  # to check shape

0    0.512808
1    0.653679
2    0.414970
3    0.667296
4    0.958226
5    0.066904
6    0.669007
7    0.131722
8    0.879987
9    0.646048
dtype: float64

(10,)

In [51]:
b=[1,2,3,4,5]
a=pd.Series(b)  # to get index nummber
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [73]:
s=pd.Series(np.random.random(4),index=["a","b","c","d"]) # to create index in alphabetical 
s

a    0.374336
b    0.833766
c    0.864106
d    0.917449
dtype: float64

In [103]:
a1=[5,6,8,4,11,20]
a2=pd.Series(a1)
a2.argmax() # it gives index number

5

In [111]:
a1=[1,2,4,5,6,8,11,20]
a2=pd.Series(a1)
a2.argsort()

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int64

In [115]:
a1=[5,6,8,4,11,20]
a2=pd.Series(a1)
a2.cumsum() # cumulative summ

0     5
1    11
2    19
3    23
4    34
5    54
dtype: int64

In [117]:
a1=[5,6,8,4,11,20]
a2=pd.Series(a1)
a2.mean()

9.0

In [119]:
a1=[5,6,8,4,11,20]
a2=pd.Series(a1)
a2.median()

7.0

In [125]:
##### it'll give all mathematical functions automatically

In [123]:
a1=[5,6,8,4,11,20]
a2=pd.Series(a1)
a2.describe()

count     6.000000
mean      9.000000
std       5.932959
min       4.000000
25%       5.250000
50%       7.000000
75%      10.250000
max      20.000000
dtype: float64

##### Data frame

In [135]:
s1=pd.Series(np.random.random(5))
s2=pd.Series(np.random.random(5))
s1,s2
a=pd.DataFrame ([s1,s2]) # to show the values in table format
a

          0         1         2         3         4
0  0.206267  0.307208  0.393565  0.831307  0.921357
1  0.336629  0.854192  0.469137  0.108319  0.966242

##### creating data frame with  help of DIC

In [163]:
d={"Age":[22,24,19],"Salary":[50000,70000,90000]}
d

{'Age': [22, 24, 19], 'Salary': [50000, 70000, 90000]}

In [169]:
type (d)

dict

In [175]:
data= pd.DataFrame (d)
data

   Age  Salary
0   22   50000
1   24   70000
2   19   90000

In [189]:
a=[5,4,8,9,6]
b=[1,2,3,7,10]
c=pd.DataFrame ([a,b])
c

   0  1  2  3   4
0  5  4  8  9   6
1  1  2  3  7  10

In [195]:
pd.DataFrame ([a,b],columns=['col_1','col_2','col_3','col_4','col_5']) # to give colm names

   col_1  col_2  col_3  col_4  col_5
0      5      4      8      9      6
1      1      2      3      7     10

In [257]:
data= pd.DataFrame (d)
data

   Age  Salary
0   22   50000
1   24   70000
2   19   90000

In [265]:
data ['Gender'] = ["male","female","other"] # to add new column

In [263]:
data

   Age  Salary  Gender
0   22   50000    male
1   24   70000  female
2   19   90000   other